# Создайте переменную name и присвойте ей значение вашего имени (строка)
name = 'Vladimir'
# Выведите значение переменной name на экран
print('Имя:', name)
# Создайте переменную age и присвойте ей значение вашего возраста (целое число)
age = 29
#Выведите значение переменной age на экран
print('Возраст:', age)
# Перезапишите в age текущее значение переменной age + новое
# age = age +1 - так тоже сработает)
# или age = 29
# new_age = age + 1
# print('Новый возраст:', new_age)
age = 29+1
# Выведите измененное значение переменной age на экран
print('Новый возраст:', age)
# Создайте переменную is_student и присвойте ей значение True (логическое значение)
is_student = True
#  Выведите значение переменной is_student на экран
print('Студент:', is_student)