# Переменные предназначены для хранения данных.
# Переменная – это кусочек памяти компьютера, в который мы можем что-то поместить, чтобы использовать позже.
# Название переменной может содержать буквенные и цифровые символы, а также подчеркивания, но начинаться оно обязательно должно именно с буквы или подчеркивания.
# Названия переменных должны не совпадать с названиями команд.
# Названия должны быть осмысленными, чтобы понимать, что находится внутри.
# Первое значение переменной
Name = 'Vladimir'
print(Name)
# Новое значение переменной
Name = 'Andrei'
print(Name)
# Есть два стиля названий переменных Snake case и Camel case
# Snake case - в нем для разделения слов используются нижние подчеркивания
Date_of_birth = 'June 8'
# Camel case - при таком стиле слова разделяются верхним регистром, то есть каждое новое слово пишется с заглавной буквы. Такой стиль используется чаще для обозначения классов.
DateOfBirth = 'June 8'
