# Задача написать три функции:
# Максимум в списке
# Подсчёт четных чисел в списке
# Уникальный список

# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Максимум в списке
def find_max(list_1):
    # Создадим переменную max_, для нахождения максимального значения
    max_ = list_1[0]
    # Циклом for пройдём по списку list_1
    for i in list_1:
        # Если i больше max_, то перезаписываем его значение
        if i > max_:
            max_ = i
    return print('Максимальное значение в списке:', max_)


# Вызываю функцию find_max со списком [157, 2, 3, 6, 12, 32]
find_max([157, 2, 3, 6, 12, 32])


# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Подсчёт четных чисел в списке
def count_even(list_2):
    # Создадим переменную, которая будет хранить счётчик
    counter = 0
    for i in list_2:
        # Если число i равно 0, то пропускаю его
        if i == 0:
            continue
        # Если число i делится на 2 без остатка, то увеличиваю счётчик на 1
        if i % 2 == 0:
            counter += 1
    return print('Количество чётных числе в списке:', counter)


# Вызываю функцию count_even со списком [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
count_even([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])


# //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Список с уникальными элементами
def unique_list(list_3):
    # Создадим переменную, которая будет хранить список
    new_list = []
    for i in list_3:
        # Если элемента i нет в списке new_list, то добавляю его в конец списка
        if i not in new_list:
            new_list.append(i)
    return print('Список с уникальными элементами:', new_list)


# Вызываю функцию unique_list со списком [1, 2, 3, 45, 1, 453, 578, 23, 5, 2, 3]
unique_list([1, 2, 3, 45, 1, 453, 578, 23, 5, 2, 3])
